---
kind: method
id: M:Autodesk.Revit.DB.DefinitionGroups.GetEnumerator
source: html/881d1e49-9d26-9fce-fb5a-1e9b371c7472.htm
---
# Autodesk.Revit.DB.DefinitionGroups.GetEnumerator Method

Retrieves an enumerator to the collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<DefinitionGroup> GetEnumerator()
```

## Returns
The enumerator.